RhinoInside.Revit API Documentation
ColorWithTransparencyConverter Class
 Converter to convert Color values to and from Autodesk.Revit.DB.ColorWithTransparency.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.System.Drawing.ColorWithTransparencyConverter
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static class ColorWithTransparencyConverter
class ColorWithTransparencyConverter
The ColorWithTransparencyConverter type exposes the following members.
Methods
Name | Description
ToColor
 Converts the specified Autodesk.Revit.DB.Color to an equivalent Color.
ToColorWithTransparency
 Converts the specified Color to an equivalent Autodesk.Revit.DB.ColorWithTransparency.
Top
See Also
Reference
RhinoInside.Revit.Convert.System.Drawing Namespace